//여기 한먼만 하면 별도 apply 필요없음
plugins {
    //코어 플러그인
    kotlin("jvm") //항상 최신버전 사용. 멀티플랫폼 버전과 동일함
}

//==================================================== 프로젝트별 설정 ======================================================
dependencies {

    //==================================================== 내부 의존성 ======================================================
    api(project(":heavy"))
    testApi(project(":core").dependencyProject.sourceSets["test"].output) //코어 테스트에 있는 공통 (testRoot 등)을 사용할 수 있게 해줌

    //==================================================== 노트북 ======================================================
    api("org.jetbrains.kotlinx:dataframe:1727") //버전 이름이 이상하다.. 갑자기 이러네



}